lxf13927043839/Stm32_code/bluetooth/USER/main.c
#include "stm32f4xx.h" 
#include "Delay.h" 
#include "led.h" 
#include "key.h" 
#include "beep.h" 
#include "exti.h"
#include "usart.h"
#include "stdio.h"
#include "adc.h"
#include "dht11.h"
#include "tim3.h"
#include "iwdg.h"
#include "rtc.h"
#include "pwm.h"
#include "24cxx.h"
#include "myiic.h"
#include "esp8266_uart4.h"
#include "string.h"
#include "lcd.h"
#include "people.h"
#include "touch.h"
#include "xpt2046.h"
#include "image2lcd.h"

//==========================================================
u8 light_streng_now=0;
u8 light_streng_set=0;

u8 open_or_close_curtain_from_server=3;//1：打开 0 关闭
//========================================================

//还没有添加定时上传服务器功能

int label_mode;//用来窗帘模式远程控制，标签
int label_closetime;//远程关闭定时设置界面

void open_rotate(void);//电机转动打开窗帘
void close_rotate(void);
void LCD_showdate(void);//刷新lcd的数据界面，在TIM3的十秒到的时候


u8 enter_set_time=0;//进入设置定时界面

u8 has_set_time_online=0;
u8 set_time_buff[18];
//---------------------------------------------------------------------------
u8 beep_status; //蜂鸣器状态位 1：开 0：关

u8 curtain_status;//0:窗帘关闭

//---------------------------------------------------------------------------
void delay_ms(u16 nms);
//---------------------显示单个汉字与汉字字符串--------------------------
void LCD_DisplayChinese_one(u16 x,u16 y,u8 word,u8 size);
void LCD_DisplayChinese_string(u16 x,u16 y,u8 size,int *p);
void LCD_DisplayChinese_string_color(u16 x,u16 y,u8 size,int *p,u16 brushcolor,u16 backcolor);

void LCD_DisplayChar(u16 x,u16 y,u8 word,u8 size); //显示一个字符
void LCD_DisplayString(u16 x,u16 y,u8 size,u8 *p); //显示一个12/16/24字体字符串

void get_all_status_data(char *data_buff);
//---------------------ESP8266--115200--------------------------------------
/*
		功能：与tlink对接的数据协议
		
		温度、湿度、光照、光照阈值、窗帘状态、智能模式开关，窗帘开关，夜晚蜂鸣器警报，窗帘定时功能，获取最新数据    夜晚蜂鸣器警报
		 12----45----78-----10 11-----13----------15-----------17-----------19------------21-------------23 ---------25----------------
*/
#define SIZE_of_DATA 28
unsigned char data_buff[SIZE_of_DATA]="#11,22,33,44,0,0,0,0,0,0,0#";
            

#define SIZE_from_SEVRVER 50
char data_fromserver[SIZE_from_SEVRVER];//接收服务器的字符串控制指令
int num_from_server=0; //接收字符数 序号
int link_success=0; //初始化esp8266模块时，看指令是否成功执行
int link_flag=0; //在连接过程中检测心跳包，在tim4中断函数中控制看门狗，

int first_ok_flag=0; //用来判断第一次的ok设置定时器的值
int ok_flag=0;	//用来反应心跳包的
unsigned char rece_status=0;//接收服务器控制指令


//串口4 的中断服务程序 ====esp8266串口4 从手机端接收的信息
void UART4_IRQHandler(void)
{
	int i=0;
	uint16_t data;
	u8 temp=5;
	//把收到的来自esp8266 模块的数据，通过USART1发给PC
	if(USART_GetITStatus(UART4, USART_IT_RXNE) != RESET)
	{
		data = USART_ReceiveData(UART4); //读数据
	
		while(USART_GetFlagStatus(USART1, USART_FLAG_TC)==RESET);
		USART_SendData(USART1, data);
		
		if(link_success==0)  //判断wifi是否成功连接到服务器上，连接不上----看门狗重启
		{
			if(data=='>')
			{
				LED2=0;
				link_success=1;
				feed_dog();
				TIM4_init(4*10000-1,8400-1); //定时器跟看门狗时间同步
				//TIM_Cmd(TIM3,DISABLE);
				TIM3_init(10000-1,8400-1);//定时1秒，用来定时上传数据以及扫描LCD屏幕
				TIM3->CNT=0;
				
				link_flag=1;//连接成功
				
				
			}
		}else if(link_success==1)  //对tlink下行控制指令、以及心跳包的处理
		{
			switch(rece_status)
			{
				case 0://0,1是对控制指令的处理
							if(data=='{')
							{
								LED0=!LED0;
								rece_status++;
							}
							else
							{
								//这里可进行优化
								data_fromserver[num_from_server]=data;
								num_from_server++;
								if(data_fromserver[num_from_server-1]=='k')
								{
									data_fromserver[num_from_server]='\0';
									if(strcmp(data_fromserver,"ok")==0)
									{
										num_from_server=0;
										data_fromserver[0]=0;
										data_fromserver[1]=0;
										data_fromserver[2]=0;
										
										if(first_ok_flag==0)
										{
											first_ok_flag=1;
											TIM2_init(14*10000-1,8400-1);//重新定时器TIM2-----14秒，跟心跳包同
											//printf("first ok is come\n");
										}
										else
										{
											//printf("重新设置计时\n");							
											TIM2->CNT=0;
										}
										
									}
								}
							}
							break;
				case 1:
							data_fromserver[num_from_server]=data;
							num_from_server++;
							if(data_fromserver[num_from_server-1]=='}')
							{
								data_fromserver[num_from_server-1]='\0';
								LED1=!LED1;
								//对命令的处理
								//前面的usart1 会打印出整个命令，所有有点不正常
								printf("order from server = %s=%d \n",data_fromserver,strlen(data_fromserver));
								
								
								
								if(strcmp(data_fromserver,"curt_on")==0)//窗帘开
								{
									AT24CXX_Read(3,(u8 *)&temp,1);//在手动模式下才能控制 , 打漏了取地址的符号
									
									if(temp==0)
									{
								
										if(curtain_status==0)
										{
											//curtain_status=1;
											//LCD_DisplayChinese_one(184,128,24,24);
//===========================================================================================											
											//add 电机控制
											//open_rotate();
											open_or_close_curtain_from_server = 1;
											printf(" open curtain from server\n");
										}
										
									}
									
									
									
								}
								else if(strcmp(data_fromserver,"curt_off")==0)//窗帘关
								{
									AT24CXX_Read(3,(u8 *)&temp,1);
									if(temp==0)
									{	
										if(curtain_status==1)
										{
											//curtain_status=0;
											//LCD_DisplayChinese_one(184,128,25,24);
//===========================================================================================
											//close_rotate();
											open_or_close_curtain_from_server = 0;
											printf("close curtain from server\n");
										}
								
										//add 电机控制
									}
								
									
								}else if(strcmp(data_fromserver,"smart_on")==0)//开智能模式
								{
									//先判断现在是处于什么模式，如果是手动模式在执行
									AT24CXX_Read(3,(u8 *)&temp,1);
									if(temp==0)
									{
										label_mode=1;
									}
									
								}
								else if(strcmp(data_fromserver,"smart_off")==0)//关智能模式
								{
									AT24CXX_Read(3,(u8 *)&temp,1);
									if(temp==1)
									{
										label_mode=1;
									}
									
								}
								else if(strcmp(data_fromserver,"setti_on ")==0)//设置定时开
								{
									//开不了啥都不用做，空着
								}
								else if(strcmp(data_fromserver,"setti_off")==0)//设置定时关
								{
									temp=4;
									AT24CXX_Write(4,(u8*)&temp,1);
									
									if(enter_set_time==1)
									{
										label_closetime=1;
									}
									has_set_time_online=0;//设备在线的时候，开启了定时，会1秒去检测一次，把它顺便关闭了即可，在那边也做了对应加强了跳转手动的条件
								}
								else if(strcmp(data_fromserver,"alarm_on")==0)//开夜晚蜂鸣器警报
								{
									
									if(beep_status==0)
									{
										AT24CXX_Read(3,(u8 *)&temp,1);
										if(temp == 1)
										{
											LCD_DisplayChinese_one(81,219,24,24);
										}
										else
										{
											LCD_DisplayChinese_one(81,199,24,24);
										}
										
