lxf13927043839/Stm32_code/bluetooth/USER/main.c
										beep_status=1;
										AT24CXX_Write(2,&beep_status,1);
									}
									
								}
								else if(strcmp(data_fromserver,"alarm_off")==0)//关夜晚蜂鸣器警报
								{
									
									if(beep_status==1)
									{
										AT24CXX_Read(3,(u8 *)&temp,1);
										if(temp == 1)
										{
											LCD_DisplayChinese_one(81,219,25,24);
										}
										else
										{
											LCD_DisplayChinese_one(81,199,25,24);
										}
										beep_status=0;
										AT24CXX_Write(2,&beep_status,1);
									
									}
									
								}
								else if(strcmp(data_fromserver,"update_on")==0)//获取最新数据
								{
									get_all_status_data(data_buff);
									SENDstr_to_server(data_buff);
									printf("update_on successful\n");
								}
								
								//##################
								for(i=0;i<SIZE_from_SEVRVER;i++)
								{
									data_fromserver[i]=0;
								}
								num_from_server=0;
								rece_status=0;
							}
							break;
				
			}
		}
		
		USART_ClearITPendingBit(UART4, USART_IT_RXNE); //清除UART4的接收中断	
	}

} 


/*
	定时器3中断服务函数
	//定时器时钟是84M 
	//分频系数是8400，所以 84M/8400=10KHZ的计数频率，计数5000次为500ms
  // 1/10 000 * 5000 = 0.5s = 500ms
  TIM3_init(5000-1,8400-1);

	------------------------看门狗----------------------------
  //时间计算：((4*2^4))/32000=0.2ms 计数一次0.2ms 500次就是1s
	IWDG_init(4,1000);

*/

int opendog_flag=-1;//用来计数10s后打开看门狗，一开始初始化定时器，会自动进一次中断----无解
int initdog=0;
int ten_second_send_flag=0;//十秒定时上传数据
/*
	在配置esp8266以及连接服务器，配置是5秒
	在连接成功的时候，更改为1秒，用来定时上传数据 
*/
void TIM3_IRQHandler(void) 
{
	if(TIM_GetITStatus(TIM3,TIM_IT_Update)==SET) //溢出中断
	{
		if(initdog==0)
		{
			opendog_flag=opendog_flag+1;    
			//printf("opendog_flag = %d\n",opendog_flag);
		}
		if(opendog_flag==2)
		{
			IWDG_init(4,500*5);
			initdog=1;
			opendog_flag=0;
			//printf("dog successful \n");
		}
		if(link_flag==1) //定时10秒上传数据
		{
			ten_second_send_flag++;
			if(ten_second_send_flag==10)
			{
				ten_second_send_flag=0;
				get_all_status_data((char *)data_buff);
				//printf("ten second send \n");
				SENDstr_to_server((char *)data_buff);
				//顺便刷新LCD的数据,在进入定时界面的时候不能去刷
				if(enter_set_time==0)
				LCD_showdate();
			}
			
		}
	}
	TIM_ClearITPendingBit(TIM3,TIM_IT_Update); //清除中断标志位
}

int tim2flag=-1;
void TIM2_IRQHandler(void)
{
	if(TIM_GetITStatus(TIM2,TIM_IT_Update)==SET) //溢出中断
	{	
			if(tim2flag==-1)
			{
				tim2flag=1;
			}
			else
			{
					printf("检测失败 启动看门狗\n");
					SENDstr_to_server("+++");	
					link_flag=0;//不进行喂狗操作
					
			}

	}
	TIM_ClearITPendingBit(TIM2,TIM_IT_Update); //清除中断标志位
}

/*
	功能：当出现 > 符号即连接成功，TIM4一直是在喂狗
				看门狗是5秒-----TIM4是4秒，因为看门狗开启后无法关闭，所有必须喂狗
*/
void TIM4_IRQHandler(void)
{
	if(TIM_GetITStatus(TIM4,TIM_IT_Update)==SET) //溢出中断
	{	
		if(link_flag==1)	
		{
			feed_dog();
			//printf("in TIM4 feeddog\n");
		}
	}
	TIM_ClearITPendingBit(TIM4,TIM_IT_Update); //清除中断标志位
}



//按键3 的中断处理函数
void EXTI9_5_IRQHandler(void)
{
	//key3
	if(RESET != EXTI_GetITStatus(EXTI_Line6))
	{
		delay_ms(10);	//去抖动
		if(key3==0)	 
		{
			//front_rotate();
		  printf("key3 test by interrupt\n");
		}		
		//清楚中断标志位，否则会一直进入中断函数
		EXTI_ClearITPendingBit(EXTI_Line6);
	}
	
	//key2
	if(RESET != EXTI_GetITStatus(EXTI_Line7))
	{
		delay_ms(10);	//去抖动
		if(key2==0)	 
		{
			
			//area_rotate();
			
			printf("\nkey2 test by interrupt\n");
		}		
		//清楚中断标志位，否则会一直进入中断函数
		EXTI_ClearITPendingBit(EXTI_Line7);
	}
	//key1
	
	if(RESET != EXTI_GetITStatus(EXTI_Line8))
	{
		delay_ms(10);	//去抖动
		if(key1==0)	 
		{	
			
			//stop_rotate();
			
			printf("\nkey1 test by interrupt\n");
		}		
		//清楚中断标志位，否则会一直进入中断函数
		EXTI_ClearITPendingBit(EXTI_Line8);
	}
	
}

////-----------电机控制初始化---------------------------------

////-----------电机控制初始化---------
//PF1(开) PF2(关) 作为窗帘关闭的检查条件 

#define BorderClose GPIO_ReadInputDataBit(GPIOF,GPIO_Pin_2)
#define BorderOpen GPIO_ReadInputDataBit(GPIOF,GPIO_Pin_1)
void CheckCurtainBorder_init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct;
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF,ENABLE);
	GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IN;
	GPIO_InitStruct.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Pin=GPIO_Pin_1|GPIO_Pin_2;
	GPIO_InitStruct.GPIO_PuPd=GPIO_PuPd_UP;
	GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOF, &GPIO_InitStruct);
}

#define ENA PBout(5)	
#define IN1 PBout(4)	
#define IN2 PBout(3) 
void ELECTRI_motor_init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	//开启GPIO时钟
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB,ENABLE);
	//初始化IO
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_4 | GPIO_Pin_3; //GPIOB5 4 3 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;//输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; //速度50MHz
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; //推挽复用输出
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP; //上拉
	GPIO_Init(GPIOB,&GPIO_InitStructure); //PB10, PB11

	GPIO_ResetBits(GPIOB,GPIO_Pin_5 | GPIO_Pin_4 | GPIO_Pin_3);
}

u8 curtain_motor_open_close=3;
void open_rotate(void)//电机转动打开窗帘
{
	ENA=1;
	IN1=1;
	IN2=0;
	curtain_motor_open_close=1;
	
	printf("electrical motor open successfully\n");
}
void close_rotate(void)
{
	ENA=1;
	IN1=0;
	IN2=1;
	curtain_motor_open_close=0;

	printf("electrical motor close successfully\n");
}
void stop_rotate(void)
{
	ENA=1;
	IN1=0;
	IN2=0;
}



///*
//	功能：获取各个传感器数据，以及控制状态值
//	

//获取dht11 光敏、
void get_all_status_data(char *data_buff)
{
	u8 temperature=0;//温度
  u8 humidity=0;   //湿度
	u16 adcx=0;		 //adc读取值  12位精度adc  2^12=4096
	int light_streng=0;
	u8 light_limit=0;//光照阈值

	u8 rtc_buf[40];
	u8 mode_of_system=5;//系统控制的模式
	u8 beep_flag=3;
	u8 time_temp=3;
	
	//没有接传感器，或者没有调用对应的初始化函数会导致出错，使得tlink，那边卡住，然后重启
	
	adcx=Get_Adc_Average(ADC_Channel_9,20);//获取通道9的转换值，20次取平均
	light_streng=(4096-adcx)*100/4096;          //获取计算后的带小数的实际电压值，比如3.1111 变化值太小，不好测量。换成百分比
	//printf("光敏:light_streng = %d\n",light_streng);
	
	//DHT11_Read_Data(&temperature,&humidity);
	//printf("温度temperature = %d \n",temperature);
	//printf("湿度humidity    = %d \n",humidity);
	
	data_buff[1]=(temperature/10)+48;
	data_buff[2]=(temperature%10)+48;
	
	data_buff[4]=(humidity/10)+48;
	data_buff[5]=(humidity%10)+48;
	
