lxf13927043839/Stm32_code/bluetooth/USER/main.c
	data_buff[7]=(light_streng/10)+48;
	data_buff[8]=(light_streng%10)+48;
	
	light_streng_now=light_streng;
	printf("light_streng_now = %d\n",light_streng_now);
	
	//光照阈值----------后面再进行优化，先实现功能
	
	
	//----------------------------------------------------------要根据到时测试的值进行修改
	AT24CXX_Read(1,&light_limit,1);
	switch(light_limit)
	{
		case 1:
						data_buff[10]=4+48;
						data_buff[11]=0+48;
						break;
		case 2:
						data_buff[10]=6+48;
						data_buff[11]=0+48;
						break;
			break;
		case 3:
						data_buff[10]=9+48;
						data_buff[11]=0+48;
						break;
			break;
	}
	light_streng_set=(data_buff[10]-48)*10+data_buff[11]-48;
	printf("light_streng_set = %d \n",light_streng_set);
	
	
	//窗帘的状态----窗帘开关------是统一的
	if(curtain_status==1)
	{
		data_buff[13]=1+48;
		data_buff[17]=1+48;
	}
	else if(curtain_status==0)
	{
		data_buff[13]=0+48;
		data_buff[17]=0+48;
	}
	
	//智能模式开关
	AT24CXX_Read(3,&mode_of_system,1);
	if(mode_of_system==1)
	{
		data_buff[15]=1+48;
	}
	else
	{
		data_buff[15]=0+48;
	}
	
	//蜂鸣器警报
	AT24CXX_Read(2,&beep_flag,1);
	if(beep_flag==1)
	{
		data_buff[19]=1+48;
	}
	else
	{
		data_buff[19]=0+48;
	}
	//窗帘定时功能
	AT24CXX_Read(4,&time_temp,1);
	if(time_temp==1||time_temp==0)
	{
		data_buff[21]=1+48;
	}
	else
	{
		data_buff[21]=0+48;
	}
	
	data_buff[23]=0+48;
	//		温度、湿度、光照、光照阈值、窗帘状态、智能模式开关，窗帘开关，夜晚蜂鸣器警报，窗帘定时功能，获取最新数据
	//	 12----45----78-----10 11-----13----------15-----------17-----------19------------21-------------23 
	
	printf("所采集的数据data = %s \n",data_buff);
}

// /*------------------------------------------------------------------- 
//	1、汉字大小：24*24共 72字节
//  2、显示汉字时调用对应序号：
//	日(0) 期(1) 时(2) 间(3) 照(4) 强(5) 度(6) 窗(7) 帘(8) 状(9) 态(10) 智(11) 能(12) 手(13) 动(14) 模(15)
//       式(16) 阈（17） 值（18） 摄氏度（19） 百分号（20） 弱（21） 中（22） 强（23） 开（24） 关（25）
// */

extern u8 Zero_to_six_clock;
void LCD_showdate(void)
{
	int x=0,y=0,x1=0,y1=0;
	int level;
	u8 temp[2];
	RTC_DateTypeDef RTC_DateStruct;
	u8 temp_buff[40]; 
	u8 mode=5;
	
	
	//温度
	x=66,y=45;
	temp[0]=data_buff[1];
	temp[1]=data_buff[2];
	LCD_DisplayString(x,y,24,temp); //显示一个24字体字符串，宽只占了12,字符显示时候
	LCD_DisplayChinese_one(x+12*2,y,19,24);
	
	//湿度
	x=165;y=45;
	temp[0]=data_buff[4];
	temp[1]=data_buff[5];
	LCD_DisplayString(x,y,24,temp); //显示一个12/16/24字体字符串
	LCD_DisplayChinese_one(x+12*2,y,20,24);

	//光照强度----采用弱、中、强来表示，数字意义不大
	AT24CXX_Read(3,&mode,1);
	if(mode==1)//智能模式
	{
		x=66;y=138;
		x1=93;y1=171;
	}
	else if(mode == 0)//手动模式
	{
		x=66;y=128;
		x1=93;y1=160;
	}
	temp[0]=data_buff[7];
	temp[1]=data_buff[8];
	LCD_DisplayString(x,y,24,temp); //显示一个12/16/24字体字符串
	LCD_DisplayChinese_one(x+12*2,y,20,24);
	
	level=(temp[0]-48)*10+(temp[1]-48);
	if(level>=0&&level<=40)
	{
		LCD_DisplayChinese_one(x1,y1,21,24);
	}
	else if(level>40&&level<=70)
	{
		LCD_DisplayChinese_one(x1,y1,22,24);
	}
	else if(level>70&&level<=100)
	{
		LCD_DisplayChinese_one(x1,y1,23,24);
	}
 
	//显示日期
	x=0;y=0;
	RTC_GetDate(RTC_Format_BIN, &RTC_DateStruct);
	sprintf((char*)temp_buff,"20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
	//printf("%s\n",temp_buff);
	LCD_DisplayString_color(x,y,24,temp_buff,WHITE,Font_time_blue); //显示一个12/16/24字体字符串
	
	//显示时间测试位置,显示ok---该函数放在秒的唤醒服务函数
	
}


////跳转到设置光照阈值的界面

extern const u8 gImage_set_light[];//设置光照阈值界面
extern const u8 gImage_set_time[]; //设置定时
extern const u8 gImage_smart_mode[];
extern const u8 gImage_hand_mode[];

/*
	功能：定时窗帘的开或者关---注意：把提示换成中文的

*/
/*

* 说    明：长按按KEY3进行时间调整，按KEY0进行数值的加1，按KEY1数值进行减1，  
            按KEY2右移选择要设置的选项，在调整完后短按KEY3，确认调整时间         
*********************************************************************************/



void Time_Display()//把变化的时间写入
{
	int x,y;
	x = 83; y = 22;

 LCD_DisplayString(x,y,24,"20  -  -  ");
 LCD_DisplayNum(x+36-12,y,RTC_DateStruct.RTC_Year,2,24,1);//把0给补上了
 LCD_DisplayNum(x+72-12,y,RTC_DateStruct.RTC_Month,2,24,1);
 LCD_DisplayNum(x+108-12,y,RTC_DateStruct.RTC_Date,2,24,1);
	
  x = 107; y = 50;

 LCD_DisplayString(x,y,24,"  :  :  ");
 LCD_DisplayNum(x+12-12,y,RTC_TimeStruct.RTC_Hours,2,24,1);	
 LCD_DisplayNum(x+48-12,y,RTC_TimeStruct.RTC_Minutes,2,24,1);
 LCD_DisplayNum(x+84-12,y,RTC_TimeStruct.RTC_Seconds,2,24,1);

}
void Time_has_set()//显示定时的时间
{
 int x,y;
 x = 36; y = 155;
 BRUSH_COLOR=BLUE;
	
 LCD_DisplayString_color(x,y,24,"20  -  -  ",BLUE,Chinese_Micolor);
 LCD_DisplayNum(x+24,y,RTC_DateStruct.RTC_Year,2,24,1);
 LCD_DisplayNum(x+60,y,RTC_DateStruct.RTC_Month,2,24,1);
 LCD_DisplayNum(x+96,y,RTC_DateStruct.RTC_Date,2,24,1);
	
 x = 60; y = 183;
 LCD_DisplayString_color(x,y,24,"  :  :  ",BLUE,Chinese_Micolor);
 LCD_DisplayNum(x,y,RTC_TimeStruct.RTC_Hours,2,24,1);	
 LCD_DisplayNum(x+36,y,RTC_TimeStruct.RTC_Minutes,2,24,1);
 LCD_DisplayNum(x+72,y,RTC_TimeStruct.RTC_Seconds,2,24,1);
	
 BRUSH_COLOR=RED;
}

//u8 const *set_option[7]={"Year","Month","Day","Hours","Minutes","Seconds"," "};
 /*------------------------------------------------------------------- 
	1、汉字大小：24*24共 72字节
    2、显示汉字时调用对应序号：
	   日(0) 期(1) 时(2) 间(3) 请(4) 重(5) 新(6) 设(7) 置(8) 选(9) 择(10) 智(11) 能(12) 手(13) 动(14) 模(15)
       式(16) 阈（17） 值（18） 摄氏度（19） 百分号（20） 弱（21） 中（22） 强（23） 开（24） 关（25）
			 年（26） 月（27）日（28）时（29）分（30）秒（31）定（32）成（33）功（34）空白（35）
 */
int set_option[6]={26,27,28,29,30,31};
int Please_Set[4]={4,7,8,-1};

void ADJUST_time(u8 option,u8 shanshuo)
{
		
	
		if(shanshuo%50==0)  //提示现在要设置的选项
		{
		  //LCD_DisplayString_color(34,99,24,"Please Set          ",BLUE,WHITE);
		  //LCD_DisplayString_color(162,99,24,(u8 *)set_option[option],BLUE,WHITE);
		
			LCD_DisplayChinese_string_color(30,99,24,Please_Set,BLUE,Chinese_Micolor);
			LCD_DisplayChinese_one(127,99,set_option[option],24);
		}
		
		//设置时数值的加减1
		if( (keydown_data==KEY0_DATA)||(keydown_data==KEY1_DATA))
		{
		  if(keydown_data==KEY0_DATA)
			{
			  switch(option)
				{
				  case 0: RTC_DateStruct.RTC_Year+=1;   break;
					case 1:
								if(RTC_DateStruct.RTC_Month==12)
								{
									RTC_DateStruct.RTC_Month=1;
								}
								else
								RTC_DateStruct.RTC_Month+=1;  
								break;
					case 2: 
								if(RTC_DateStruct.RTC_Date==28&&RTC_DateStruct.RTC_Month==2&&RTC_DateStruct.RTC_Year%4!=0)
								{
									RTC_DateStruct.RTC_Date=1;
								}
								else if(RTC_DateStruct.RTC_Date==29&&RTC_DateStruct.RTC_Month==2&&RTC_DateStruct.RTC_Year%4==0)
								{
									RTC_DateStruct.RTC_Date=1;
								}
								else if(RTC_DateStruct.RTC_Date==30)
								{
									switch(RTC_DateStruct.RTC_Month)
									{
										case 4:
										case 6:
										case 9:
										case 11:
														RTC_DateStruct.RTC_Date=1;
														break;
										case 1:
										case 3:
										case 5:
										case 7:
										case 8:
										case 10:
										case 12:
														RTC_DateStruct.RTC_Date+=1;
														break;
									}
								}
								else if(RTC_DateStruct.RTC_Date==31)
								{
									RTC_DateStruct.RTC_Date=1;
								}
								else
								RTC_DateStruct.RTC_Date+=1;   
								break;
					case 3: 
								if(RTC_TimeStruct.RTC_Hours==23)
								{
									RTC_TimeStruct.RTC_Hours=0;
								}
								else
								RTC_TimeStruct.RTC_Hours+=1;  
								break;
					case 4: 
								if(RTC_TimeStruct.RTC_Minutes==59)
								{
									RTC_TimeStruct.RTC_Minutes=0;
								}
								else
								RTC_TimeStruct.RTC_Minutes+=1;
								break;
					case 5: 
								if(RTC_TimeStruct.RTC_Seconds==59)
								{
									RTC_TimeStruct.RTC_Seconds=0;
								}
								else
								RTC_TimeStruct.RTC_Seconds+=1;
								break;
				}	
			}
			if(keydown_data==KEY1_DATA)
			{
			  switch(option)
				{
				  case 0: RTC_DateStruct.RTC_Year-=1; break;
					case 1: 
								if(RTC_DateStruct.RTC_Month==1)
								{
									RTC_DateStruct.RTC_Month=12;
								}
								else
								RTC_DateStruct.RTC_Month-=1;
								break;
					case 2: 
								if(RTC_DateStruct.RTC_Date==1)
								{
									if((RTC_DateStruct.RTC_Year)%4==0&&(RTC_DateStruct.RTC_Month)==2)
									{
										RTC_DateStruct.RTC_Date=29;
									}
									else
									{
										if((RTC_DateStruct.RTC_Month)==2)
										{
											RTC_DateStruct.RTC_Date=28;
										}
										else
										{
											switch((RTC_DateStruct.RTC_Month))
											{
												case 1:
												case 3:
												case 5:
												case 7:
												case 8:
												case 10:
												case 12:
																RTC_DateStruct.RTC_Date=31;
												break;
												
												case 4:
												case 6:
												case 9:
												case 11:
																RTC_DateStruct.RTC_Date=30;
												break;
											}
										}
									}
								}
								else								
								RTC_DateStruct.RTC_Date-=1;//考虑到
							
								break;
					case 3: 
								if(RTC_TimeStruct.RTC_Hours==0)
								{
									RTC_TimeStruct.RTC_Hours=23;
								}
								else
								RTC_TimeStruct.RTC_Hours-=1;
							
								break;
					case 4: 
								if(RTC_TimeStruct.RTC_Hours==0)
								{
									RTC_TimeStruct.RTC_Minutes=59;
								}
								else
								RTC_TimeStruct.RTC_Minutes-=1;
								break;
					case 5: 
								if(RTC_TimeStruct.RTC_Seconds==0)
								{
									RTC_TimeStruct.RTC_Seconds=59;
								}
								else
								RTC_TimeStruct.RTC_Seconds-=1;
								break;
				}	
			}
		}
		//闪烁显示：显示
	if(shanshuo==150)
	{
			Time_Display();
//			LCD_DisplayNum(86,220,RTC_DateStruct.RTC_Year,2,16,1);
//			LCD_DisplayNum(110,220,RTC_DateStruct.RTC_Month,2,16,1);
//			LCD_DisplayNum(134,220,RTC_DateStruct.RTC_Date,2,16,1);
//			LCD_DisplayNum(70,240,RTC_TimeStruct.RTC_Hours,2,16,1);
//			LCD_DisplayNum(94,240,RTC_TimeStruct.RTC_Minutes,2,16,1);
//			LCD_DisplayNum(118,240,RTC_TimeStruct.RTC_Seconds,2,16,1);
	}	
		//闪烁显示：不显示
	
	switch(option)
	{  
		//"20  -  -  "开头83
		case 0: {  if(shanshuo==49)  LCD_DisplayString(83+12*2,22,24,"  ");	 break;  }
		case 1: {  if(shanshuo==49)  LCD_DisplayString(83+12*5,22,24,"  "); break;  }
		case 2: {  if(shanshuo==49)  LCD_DisplayString(83+12*8,22,24,"  "); break;  }
		
