lxf13927043839/Stm32_code/bluetooth/USER/main.c
		//"  :  :  "  开头107
		case 3: {  if(shanshuo==49)  LCD_DisplayString(107,50,24,"  ");  break;  }
		case 4: {  if(shanshuo==49)	 LCD_DisplayString(107+12*3,50,24,"  ");	 break;	 }
		case 5: {  if(shanshuo==49)	 LCD_DisplayString(107+12*6,50,24,"  "); break;  }		
	}
}	


void SET_time(void)
{
	//注：有一些函数是初始化过了的，整合时候要删除
	
	u8 process=0;  //程序流程走向
	u8 option=0;     //调整时间选项
	u8 t=0,j;      //计时参数
	u8 time_set_flag=0;//是否设置了按键的定时标志
	u8 now_date_buff[40];//当前的日期
	u8 now_time_buff[40];//当前的时间

	u8 time_buff[40]={0};//存放定时的时间,没有初始化会出现一些意外的bug，如出现一斜杆
	u8 date_buff[40]={0};//存放定时的日期
	u8 test[40];//从24c02 读取数据测试
	u8 curtain_status_choose_insettime=3;//选择窗帘状态,只有0/1 状态是有效的，其他数字是无效的
	short set_tim_success=-1; //时间的设置是正常的 
	u8 had_settimeflag=3; //检测是否有设置了

	u8 set_curtain_status;//定时设置窗帘的开关，不是直接反应窗帘状态,用来清理=3
	u8 enter_key3_func=4;
	int curtain_content[2]={0,-1};
	u8 set_time_successful=0;//0 ：未设置，1：设置成功
	
 /*------------------------------------------------------------------- 
	1、汉字大小：24*24共 72字节
    2、显示汉字时调用对应序号：
	   日(0) 期(1) 时(2) 间(3) 请(4) 重(5) 新(6) 设(7) 置(8) 选(9) 择(10) 先(11) 点(12) 击(13) 动(14) 模(15)
       式(16) 阈（17） 值（18） 摄氏度（19） 百分号（20） 弱（21） 中（22） 强（23） 开（24） 关（25）
			 年（26） 月（27）日（28）时（29）分（30）秒（31）定（32）成（33）功（34）空白（35）
 */
		int Chinese_Reset_Time[8]={4,5,6,7,8,2,3,-1};
		int Chinese_Reset_Date[8]={4,5,6,7,8,0,1,-1};
		int Chinese_Reset_Switch[7]={4,5,6,9,10,24,-1};
		int Chinese_Set_Time_Ok[7]={32,2,7,8,33,34,-1};
		int Chinese_Reset_Close[7]={25,-1};
		int Chinese_Clear_Set[9]={35,35,35,35,35,35,35,35,-1};
		int Chinese_Click_Close[5]={4,11,12,13,-1};
		
		char line= '/';
	
	
	
	//待删除部分
	/*
	LCD_DisplayString(10,10,24,"Illuminati STM32F4");	
	LCD_DisplayString(10,40,16,"Author:Clever");
	LCD_DisplayString(30,70,24,"14.RTC TEST");
	LCD_DisplayString(30,100,16,"KEY3 Long :Adjust time");
	LCD_DisplayString(30,120,16,"     Short:Adjust OK");
	LCD_DisplayString(30,140,16,"KEY0: V++  KEY1: V--");
	LCD_DisplayString(30,160,16,"KEY2: Right Move");
	*/
	
	//显示界面
	image_display(0,0,(u8*)gImage_set_time);
	
	//先刷一下时间，不会出现闪烁情况
	RTC_GetTimes(RTC_Format_BIN);//获取系统时间
	Time_Display();
	
	//判断之前是否有设置了定时
	AT24CXX_Read(4,&had_settimeflag,1);
	if(had_settimeflag==1||had_settimeflag==0)
	{
		//printf("正在画图\n");
		
		AT24CXX_Read(5,(u8 *)date_buff,10);
		LCD_DisplayString_color(36,155,24,date_buff,BLUE,Chinese_Micolor);
		//一些延时会导致画面出现闪烁
		AT24CXX_Read(15,(u8 *)time_buff,8);
		LCD_DisplayString_color(60,183,24,time_buff,BLUE,Chinese_Micolor);
		
		//printf("SET_Time 中的  time_buff = %s \n",date_buff);
		//printf("SET_Time 中的  time_buff = %s \n",time_buff);
		
		set_time_successful=1;//不可以去选择开关了，在开关画个x
		if(had_settimeflag==0)
		{
			curtain_content[0]=25;
			LCD_DisplayChinese_string_color(207,170,24,curtain_content,BLUE,Chinese_Micolor);//显示窗帘状态
		}else if(had_settimeflag==1)
		{
			curtain_content[0]=24;
			LCD_DisplayChinese_string_color(207,170,24,curtain_content,BLUE,Chinese_Micolor);//显示窗帘状态
		}
	}
	

	
  while(1) 
	{		
		key_scan_advanced(0);	
		t++;
		//add
		XPT2046_Scan(0);
		
		if(label_closetime==1)
		{
			goto close;
		}
		
		//返回
		if(Xdown>0&&Xdown<30&&Ydown>0&&Ydown<50)
		{
end:
			delay_ms(200);
			enter_set_time=0;
			//printf("break successful\n");
			break;
		}
		//开
		if(Xdown>108&&Xdown<153&&Ydown>220&&Ydown<265)
		{
			delay_ms(200);
			
			if(set_time_successful==0)//还没有设置成功！还可以点击
			{
				curtain_content[0]=24;
				LCD_DisplayChinese_string_color(207,170,24,curtain_content,BLUE,Chinese_Micolor);//显示窗帘状态
				curtain_status_choose_insettime=1;
			}
			
		}
		//关
		if(Xdown>153&&Xdown<198&&Ydown>220&&Ydown<265)
		{
			delay_ms(200);
			
			if(set_time_successful==0)//还没有设置成功！还可以点击
			{
				curtain_content[0]=25;
				LCD_DisplayChinese_string_color(207,170,24,curtain_content,BLUE,Chinese_Micolor);//显示窗帘状态
				curtain_status_choose_insettime=0;
			}
			
		}
		//关闭/取消定时
		if(Xdown>198&&Xdown<240&&Ydown>220&&Ydown<265)
		{
			delay_ms(200);
close:			
			label_closetime=0;
			image_display(0,0,(u8*)gImage_set_time);
			process=0;
			set_curtain_status=3;
			//在添加上把at24c02里边的值清理干净
			AT24CXX_Write(4,(u8*)&set_curtain_status,1);
			has_set_time_online=0;//是否设置了定时，让rtc的秒中断实时去处理
			
			set_time_successful=0;//可以重新选择窗帘状态
			
			set_tim_success=0;//取消了设置，需要对设置定时成功的标志清一下
		}
		
		
		
		switch(process)
		{
			case 0:   // 流程0：时钟显示
			     {
						 if(key_tem==4&&key_time>250)//长按1.25秒，按键释放时，key_time自动设置0，见key.c
							{
								AT24CXX_Read(4,&enter_key3_func,1);
								if(enter_key3_func==1 || enter_key3_func==0)//表明有设置了，不进入key3调时
								{
									LCD_DisplayChinese_string_color(30,99,24,Chinese_Click_Close,BLUE,Chinese_Micolor);
									LCD_DisplayString_color(126,99,24,"CLOSE",RED,Chinese_Micolor);
								}
								else//没有设置时间
								{
									process=1;   //长按KEY3 进入调整时间流程
								}
								
								break;
							}
						 if( ((t%50)==0) && (time_set_flag==0) )	//每250ms更新显示,并且没有定时
							{
								RTC_GetTimes(RTC_Format_BIN);//获取系统时间
								Time_Display();
							} 
						break;
			     }
			case 1:    // 流程1：调整时间
					{
					 if(keydown_data==KEY2_DATA) //按KEY2选项右移
					 {
							 option++;
							 if(option>5)   //循环
								 option=0;
					 }
					 					 
					 ADJUST_time(option,t);//调整时间函数
					 if(keydown_data==KEY3_DATA)
					 {
						 //Time_Display();// 防止在闪烁不显示的时候，短按KEY3确认调整后 显示空
						 //RTC_SetTimes(RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date,RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
						 //RTC_GetTimes(RTC_Format_BIN);
						 //Time_Display();
						 

						 Time_has_set();//先显示用户设置的时间，在判断其合理性
						 
						 //存放设置的时间日期
						 sprintf((char*)date_buff,"20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
						 //printf("%s  length = %d\n",date_buff,strlen(date_buff));
						 sprintf((char*)time_buff,"%02d:%02d:%02d",RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
						 //printf("%s  length = %d\n",time_buff,strlen(time_buff));
						
						//获取当前的时间日期,更改了时间，等等重新需要设置定时的时候，就是最新的时间了
						 RTC_GetTimes(RTC_Format_BIN);
						 
						 sprintf((char*)now_date_buff,"20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
						 //printf("%s  length = %d\n",now_date_buff,strlen(now_date_buff));
						 sprintf((char*)now_time_buff,"%02d:%02d:%02d",RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
						 //printf("%s  length = %d\n",now_time_buff,strlen(now_time_buff));
						 
						 
						 if(strcmp(date_buff,now_date_buff)>0)
						 {
								//printf("set date ok\n");	
								set_tim_success=1;
						 }
						 else if(strcmp(date_buff,now_date_buff)==0)
						 {
								if(strcmp(time_buff,now_time_buff)>0)
								{
									//printf("set time ok\n");
									set_tim_success=1;
								}
								else
								{
									//printf("set time no\n");
									//LCD_DisplayString_color(34,99,24,"Please Reset time",BLUE,WHITE);
									
									LCD_DisplayChinese_string_color(30,99,24,Chinese_Reset_Time,BLUE,Chinese_Micolor);
									
