lxf13927043839/Stm32_code/bluetooth/USER/main.c
									for(j=0;j<200;j++) delay_ms(10);
									//显示后把位置清空一下，不要影响到后边的显示===设置   年
									LCD_DisplayChinese_string_color(30,99,24,Chinese_Clear_Set,BLUE,WHITE);
									
									set_time_successful=0;//设置失败，可以重新选择窗帘状态
								}
						 }
						 else
						 {
								//printf("set date no\n");
								//LCD_DisplayString_color(34,99,24,"Please Reset date",BLUE,WHITE);
							  LCD_DisplayChinese_string_color(30,99,24,Chinese_Reset_Date,BLUE,Chinese_Micolor);
							  for(j=0;j<200;j++) delay_ms(10);
							 
							 //显示后把位置清空一下，不要影响到后边的显示===设置   年
								LCD_DisplayChinese_string_color(30,99,24,Chinese_Clear_Set,BLUE,WHITE);
								set_time_successful=0;//设置失败，可以重新选择窗帘状态
						 }
						 
						 //设置的定时没有问题，再确认有选择窗帘开关，写入at24c02，时间比窗帘的开关更有必要
						 if(set_tim_success==1)
						 {
							 if(curtain_status_choose_insettime ==1 ||curtain_status_choose_insettime ==0)
							 {
									printf("set and choose ok，curtain_status= %d \n",curtain_status_choose_insettime);
									//LCD_DisplayString_color(34,99,24,"Adjust TIM OK          ",BLUE,WHITE);
									
								 LCD_DisplayChinese_string_color(30 ,99,24,Chinese_Set_Time_Ok,BLUE,Chinese_Micolor);
								 for(j=0;j<200;j++) delay_ms(10);  // Adjust OK 调整OK显示2秒
									//LCD_DisplayString(30,280,24,"                        ");
									
								 /*
										定时ok，窗帘选择ok，接下来就要写进入到at24c02中
										例子：
								  //AT24CXX_Write(0,(u8*)date_buff,strlen(date_buff));
									//AT24CXX_Read(0,test,strlen(date_buff));
									//printf("test = %s\n",test);
								 */
									AT24CXX_Write(4,(u8*)&curtain_status_choose_insettime,1);
									//delay_ms(100);
								  //AT24CXX_Read(4,&temp,1);
									//printf("temp = %d \n",temp);
									
									AT24CXX_Write(5,(u8*)date_buff,strlen(date_buff));
									delay_ms(50);
									AT24CXX_Write(15,(u8*)time_buff,strlen(time_buff));
									delay_ms(50);
									
									AT24CXX_Read(5,set_time_buff,strlen(date_buff)+strlen(time_buff));
									
									//printf("test = %s\n",test);
									has_set_time_online=1;
									set_time_successful=1;//定时成功---不可以再去选择窗帘状态
									curtain_status_choose_insettime=3;//定时成功后，又想在同个界面重新定时，
																										
									set_tim_success=0;//防止继续设置，会导致设置成功，需要清零
									
								  option=0;    //选项从头来
									process=0;   //短按KEY3时间设置完成 返回到时间显示
									goto end;
									break;
								 
							 }
							 else
							 {
								 set_tim_success=0;//上边如果没有执行到，就清除不了，设置成功 标志位，导致下一次，选择开关直接默认成功了
								 
									//LCD_DisplayString_color(34,99,24,"Please choose on/off",BLUE,WHITE);
									LCD_DisplayChinese_string_color(30,99,24,Chinese_Reset_Switch,BLUE,Chinese_Micolor);
									LCD_DisplayString_color(174,99,24,(u8 *)&line,BLUE,Chinese_Micolor);
									LCD_DisplayChinese_string_color(186 ,99,24,Chinese_Reset_Close,BLUE,Chinese_Micolor);
									
								 for(j=0;j<200;j++) delay_ms(10);
									//image_display(0,0,(u8*)gImage_set_time);
								 //显示后把位置清空一下，不要影响到后边的显示===设置   年
									LCD_DisplayChinese_string_color(30,99,24,Chinese_Clear_Set,BLUE,WHITE);
							 }
						 }

						 
					 }
					break;
			   }
	  }
		delay_ms(5); //系统延时，也算是系统计时
	}	
}

/*
	功能：在00：00-06：00利用人体红外检测检测蜂鸣器警报
	用户开启后才起作用
*/
void beepalarm_in_night(void)
{
	int haspeople=0;
	haspeople=People_scan();
	if(haspeople==1)
	{
		
		if(beep_status==1)
		{
			//BEEP=1;
		  printf("beep is ringing\n");
		}
		
		data_buff[25]=5+48;
	}
	else
	{
		//BEEP=0;
		//printf("no people \n");
		data_buff[25]=0+48;
	}
}
//-*****************************************//


u8 light_control_valid;
//尽量最终程序减少不必要的打印

int main()
{
	int adcx;
	/*
		定义标志变量
		初始值都是-1
		在变量后边，对所赋值进行说明
	*/
	u8 status;

	u8 system_mode=0;//1:智能 0：手动
	u8 light_status=0;//1:弱 2：中 3：强
	
	RTC_TimeTypeDef RTC_TimeStruct_in_main;
	u8 temp_buff[40];
	
	//test
	Systick_init(168);  //初始化延时函数，没有初始化会导致程序卡死
	
	BEEP_init();
	LED_init();
  KEY_init();
	EXTI_init( );
	
	//全局红色
	BRUSH_COLOR = RED;
	BACK_COLOR = 0xEF9C;
	
	UART1_init(115200);
	printf("reset ----\n");
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
	
	AT24CXX_init(); 
	while(AT24CXX_Check())
	{
		printf("AT24CXX 检测失败\n");
  	LED0=!LED0;
	}
	
  //如果没有dht11 灯会闪烁，需解释出来
//	while(DHT11_init())
//	{
//		LED1=!LED1;
//	}
	
	People_init();
	
	//光敏   需解释出来，在更新数据部分也要解出来
	ADC_init();   
	adcx=Get_Adc_Average(ADC_Channel_9,20);//获取通道9的转换值，20次取平均
	light_streng_now=(4096-adcx)*100/4096;
	
	My_RTC_init();
	
	//在这里设置选择了ck_spre的时钟频率，即1HZ的频率
	//所有给0 会产生1S
	//可看寄存器的配置,10x是选择了ck_spre的时钟频率
	RTC_Set_WakeUp(RTC_WakeUpClock_CK_SPRE_16bits,0);//WAKE UP 
	
	
	TIM3_init(5*10000-1,8400-1);//定时器5秒检测开看门狗
	ESP8266_UART4_init(115200);
	WIFI_Server_Init();
	
	//ALL_SENSOR_init();
	LCD_init();  //初始化LCD FSMC接口和显示驱动
	
	Touch_Init();				//触摸屏的初始化
	
	printf("start \n");
	
	//电机部分初始化
	CheckCurtainBorder_init();
	ELECTRI_motor_init();
	//先对24C02存储的值进行判断，先初始化一下，可以进行优化一下

	//光照阈值
	AT24CXX_Read(1,&status,1);
	if(status!=1&&status!=2&&status!=3)
	{
		status=1;
		AT24CXX_Write(1,&status,1);
	}
	//夜晚蜂鸣器
	AT24CXX_Read(2,&beep_status,1);
	if(beep_status!=0&&beep_status!=1)
	{
		beep_status=0;
		AT24CXX_Write(2,&beep_status,1);
	}
	//模式
	AT24CXX_Read(3,&status,1);
	if(status!=0&&status!=1)
	{
		status=0;
		AT24CXX_Write(3,&status,1);
	}
	

	while(1)
	{
		switch(status)
		{
			case 1://------------------------------智能模式-------------------
			
				light_control_valid=1;
				image_display(0,0,(u8*)gImage_smart_mode);
				LCD_showdate();//十秒刷新一次，到时候
			
				//不会让时间闪烁一下
				RTC_GetTime(RTC_Format_BIN,&RTC_TimeStruct_in_main);
				sprintf((char*)temp_buff,"%02d:%02d:%02d",RTC_TimeStruct_in_main.RTC_Hours,RTC_TimeStruct_in_main.RTC_Minutes,RTC_TimeStruct_in_main.RTC_Seconds);
				LCD_DisplayString_color(143,0,24,temp_buff,WHITE,Font_time_blue); //显示一个12/16/24字体字符串
			
			
				AT24CXX_Read(1,&light_status,1);
				if(light_status==1)//弱
				{
					LCD_DisplayChinese_one(179,219,21,24);
				}else if(light_status==2)//中
				{
					LCD_DisplayChinese_one(179,219,22,24);
				}else if(light_status==3)//强
				{
					LCD_DisplayChinese_one(179,219,23,24);
				}
			
				//窗帘状态----到时候会先去读取该值的
				if(curtain_status==0)
				{
					LCD_DisplayChinese_one(184,138,25,24);
				}
				else if(curtain_status==1)
				{
					LCD_DisplayChinese_one(184,138,24,24);
				}
				
				//显示模式
				/*
				chinese_mode[0]=11;
				chinese_mode[1]=12;
				LCD_DisplayChinese_string(135,223,24,chinese_mode);
				*/
			
