lxf13927043839/Stm32_code/bluetooth/USER/main.c
				//夜晚蜂鸣器
				AT24CXX_Read(2,&beep_status,1);
				if(beep_status==0)
				{
					LCD_DisplayChinese_one(81,219,25,24);
				}
				else if(beep_status==1)
				{
					LCD_DisplayChinese_one(81,219,24,24);
				}
//---------------------------------------------------------------------			
				while(1)
				{
					XPT2046_Scan(0);
					//------------加光照阈值-------------
					if(Xdown>127&&Xdown<167&&Ydown>243&&Ydown<283)
					{
						delay_ms(200);
						
						light_status++;
						if(light_status>3)
						{
							light_status=1;
							LCD_DisplayChinese_one(179,219,21,24);
						}
						else
						{
							if(light_status==1)
							{
								LCD_DisplayChinese_one(179,219,21,24);
							}
							else if(light_status==2)
							{
								LCD_DisplayChinese_one(179,219,22,24);
							}
							else if(light_status==3)
							{
								LCD_DisplayChinese_one(179,219,23,24);
							}
						}
						
						AT24CXX_Write(1,&light_status,1);
						
					}
					//-------------减光照阈值-------------------
					if(Xdown>170&&Xdown<210&&Ydown>243&&Ydown<283)
					{
						delay_ms(200);
						
						light_status--;
						if(light_status<1)
						{
							light_status=3;
							LCD_DisplayChinese_one(179,219,23,24);
						}
						else
						{
							if(light_status==1)
							{
								LCD_DisplayChinese_one(179,219,21,24);
							}
							else if(light_status==2)
							{
								LCD_DisplayChinese_one(179,219,22,24);
							}
							else if(light_status==3)
							{
								LCD_DisplayChinese_one(179,219,23,24);
							}
						}
						AT24CXX_Write(1,&light_status,1);
					}
					
					if(label_mode==1)
					{
						goto smart_mode;
					}
					
					//切换模式
					if(Xdown>0&&Xdown<35&&Ydown>135&&Ydown<190)
					{
						
						delay_ms(200);
smart_mode:
						label_mode=0;
						status=0;
						
						system_mode=0;
						AT24CXX_Write(3,&system_mode,1);
						
						break;
					}
					//夜晚蜂鸣器
					if(Xdown>30&&Xdown<80&&Ydown>210&&Ydown<260)
					{
						delay_ms(200);
						
						if(beep_status==0)
						{
							LCD_DisplayChinese_one(81,219,24,24);
							beep_status=1;
							AT24CXX_Write(2,&beep_status,1);
						}
						else if(beep_status==1)
						{
							LCD_DisplayChinese_one(81,219,25,24);
							beep_status=0;
							AT24CXX_Write(2,&beep_status,1);
						}
						printf("蜂鸣器\n");
					}
					if(Zero_to_six_clock==1)
		 			{
						beepalarm_in_night();
					}
					else
					{
						data_buff[25]=0+48;
					}
//=================================================================================
					if(light_streng_now>light_streng_set)//光照强，关窗帘 light_streng_set会每十秒检测有没有改动
					{
						if(curtain_status==1&&light_control_valid==1)
						{
							close_rotate();
							curtain_status=0;
							LCD_DisplayChinese_one(184,138,25,24);//窗帘状态
							printf("curtain close because light strength too high\n");
						}
					}
					else	//当前光照不强，打开窗帘
					{
						if(curtain_status==0&&light_control_valid==1)
						{
							open_rotate();
							curtain_status=1;
							LCD_DisplayChinese_one(184,138,24,24);//窗帘状态
							printf("curtain open beacause light weak\n");
						}
					}
//========================检测电机转动是否到达了边界=========================
					if(curtain_motor_open_close == 1) //开窗帘
					{
						if(BorderOpen == 1)
						{
							delay_ms(10);
							if(BorderOpen == 1)
							{
								stop_rotate();
								//printf("light = %d\n",BorderOpen);
								curtain_motor_open_close=3;
							}
							
						}
					}
					else if(curtain_motor_open_close == 0)
					{
						if(BorderClose == 1)
						{
							delay_ms(10);
							if(BorderClose == 1)
							{
								stop_rotate();
								//printf("light = %d\n",BorderOpen);
								curtain_motor_open_close=3;
							}
							
						}
					}					
//===================================================================================					
					
					
				}
				break;
			
			case 0://-------------------------手动-------------------------
				
			
				image_display(0,0,(u8*)gImage_hand_mode);
				LCD_showdate();
			
				//不会让时间闪烁一下
				RTC_GetTime(RTC_Format_BIN,&RTC_TimeStruct_in_main);
				sprintf((char*)temp_buff,"%02d:%02d:%02d",RTC_TimeStruct_in_main.RTC_Hours,RTC_TimeStruct_in_main.RTC_Minutes,RTC_TimeStruct_in_main.RTC_Seconds);
				LCD_DisplayString_color(143,0,24,temp_buff,WHITE,Font_time_blue); //显示一个12/16/24字体字符串
//-----------------------------------------------------------			
				//窗帘状态----到时候会先去读取该值的
				if(curtain_status==0)
				{
					LCD_DisplayChinese_one(184,128,25,24);//窗帘状态
				}
				else if(curtain_status==1)
				{
					LCD_DisplayChinese_one(184,128,24,24);//窗帘状态
				}
			
				
				//显示模式
				/*
				chinese_mode[0]=13;
				chinese_mode[1]=14;
				LCD_DisplayChinese_string(140,173,24,chinese_mode);
				*/
				
				//夜晚蜂鸣器
				AT24CXX_Read(2,&beep_status,1);
				if(beep_status==0)
				{
					LCD_DisplayChinese_one(81,199,25,24);
				}
				else if(beep_status==1)
				{
					LCD_DisplayChinese_one(81,199,24,24);
				}
//---------------------------------------------------------------------			
			
				while(1)
				{
					XPT2046_Scan(0);
					if(label_mode==1)
					{
						goto hand_mode;
					}
					
					if(open_or_close_curtain_from_server==1)
					{
						goto open_curtain_from_server;
					}else if(open_or_close_curtain_from_server == 0)
					{
						goto close_curtain_from_server;
					}
					
					//切换模式
					if(Xdown>209&&Xdown<240&&Ydown>138&&Ydown<188)
					{

						delay_ms(300);
hand_mode:
						label_mode=0;
						status=1;
					
						system_mode=1;
						AT24CXX_Write(3,&system_mode,1);
						//printf("switch \n");
						break;
					}
					
					//窗帘ON
					if(Xdown>120&&Xdown<170&&Ydown>192&&Ydown<242)
					{
						delay_ms(200);
open_curtain_from_server:
						LCD_DisplayChinese_one(184,128,24,24);
						
						if(curtain_status==0)
						{
							curtain_status=1;
						//add 马上发送消息到服务器上，不要切太快
							get_all_status_data(data_buff);
							SENDstr_to_server(data_buff);
//=======================================================
							open_rotate();
							open_or_close_curtain_from_server = 3;//使得服务器的控制指令只执行一遍
							printf("curtain open from hand mode\n");
						}
						
						//printf("on \n");
					}
					
