lxf13927043839/Stm32_code/bluetooth/USER/main.c
					//窗帘OFF
						if(Xdown>170&&Xdown<210&&Ydown>192&&Ydown<242)
					{
						delay_ms(200);
close_curtain_from_server:
						LCD_DisplayChinese_one(184,128,25,24);
						
						if(curtain_status==1)
						{
							curtain_status=0;
							//add 马上发送消息到服务器上，不要切太快
							get_all_status_data(data_buff);
							SENDstr_to_server(data_buff);
//====================================================================	
							close_rotate();
							open_or_close_curtain_from_server = 3;//使得服务器的控制指令只执行一遍
							printf("curtain off by hand mode\n");
						}
						//printf("off \n");

					}
					
					//设置定时开关
					if(Xdown>170&&Xdown<220&&Ydown>280&&Ydown<320)
					{
						delay_ms(200);
						enter_set_time=1;
						SET_time();
						
						break;//重新进入手动模式，刷新界面
					}
					
					//夜晚蜂鸣器
					if(Xdown>30&&Xdown<80&&Ydown>190&&Ydown<240)
					{
						delay_ms(300);
						
						if(beep_status==0)
						{
							LCD_DisplayChinese_one(81,199,24,24);
							beep_status=1;
							AT24CXX_Write(2,&beep_status,1);
						}
						else if(beep_status==1)
						{
							LCD_DisplayChinese_one(81,199,25,24);
							beep_status=0;
							AT24CXX_Write(2,&beep_status,1);
						}
						//printf("蜂鸣器\n");
					}
					if(Zero_to_six_clock==1)
					{
						beepalarm_in_night();
					}
					else
					{
						data_buff[25]=0+48;
					}

//========================检测电机转动是否到达了边界=========================
					if(curtain_motor_open_close == 1) //开窗帘
					{
						if(BorderOpen == 1)
						{
							delay_ms(10);
							if(BorderOpen == 1)
							{
								stop_rotate();
								//printf("light = %d\n",BorderOpen);
								curtain_motor_open_close=3;
							}
							
						}
					}
					else if(curtain_motor_open_close == 0)
					{
						if(BorderClose == 1)
						{
							delay_ms(10);
							if(BorderClose == 1)
							{
								stop_rotate();
								//printf("light = %d\n",BorderOpen);
								curtain_motor_open_close=3;
							}
							
						}
					}					
				}
				break;
		}
	}

}


